emacs/modes/cc-mode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>cc-mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">cc-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8e345d3">1. 概述</a></li>
<li><a href="#org87ea9f6">2. 基本使用</a>
<ul>
<li><a href="#org271fa92">2.1. 缩进量</a></li>
<li><a href="#orgc19f739">2.2. 缩进样式</a></li>
<li><a href="#orgf02cca0">2.3. 自动缩进</a></li>
<li><a href="#orgcf66771">2.4. 快捷键</a>
<ul>
<li><a href="#org5edd8a6">2.4.1. C-c C-q (c-indent-defun)</a></li>
<li><a href="#org68261ba">2.4.2. C-M-h (c-mark-function)</a></li>
<li><a href="#orgd60f27a">2.4.3. C-M-a (c-beginning-of-defun)</a></li>
<li><a href="#org8e4c9c2">2.4.4. C-M-e (c-end-of-defun)</a></li>
<li><a href="#orgd095624">2.4.5. M-a (c-beginning-of-statement)</a></li>
<li><a href="#org622adef">2.4.6. M-e (c-end-of-statement)</a></li>
<li><a href="#org1428883">2.4.7. C-c C-u (c-up-conditional)</a></li>
<li><a href="#orgca690c9">2.4.8. M-x c-up-conditional-with-else</a></li>
<li><a href="#org9502edc">2.4.9. M-x c-down-conditional-with-else</a></li>
<li><a href="#orge4498cd">2.4.10. C-c C-p (c-backward-conditional)</a></li>
<li><a href="#org3b08155">2.4.11. C-c C-n (c-forward-conditional)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge7c0022">3. minor modes</a>
<ul>
<li><a href="#org5752fd8">3.1. electric mode</a></li>
<li><a href="#org2274ed9">3.2. auto-newline mode</a></li>
<li><a href="#org1cd6da7">3.3. hungry-delete mode</a></li>
<li><a href="#org0087ae6">3.4. subword mode</a></li>
<li><a href="#org16a5a5b">3.5. syntactic-indentation mode</a></li>
</ul>
</li>
<li><a href="#org879ad8b">4. hooks</a></li>
<li><a href="#org1326c62">5. style</a>
<ul>
<li><a href="#org14b0b53">5.1. build-in style</a></li>
<li><a href="#orgae7de97">5.2. 选择 style</a></li>
<li><a href="#org76dbda6">5.3. 添加和修改 style</a></li>
<li><a href="#orgb666a01">5.4. 猜测 style</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org8e345d3" class="outline-2">
<h2 id="org8e345d3"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
cc-mode 支持编辑 C，C ++，Objective-C，Java，CORBA 的接口定义语言，Pike1 和 AWK 文件。 尽管 AWK 尚未像其他语言一样整合，但通过这种方式，可以轻松设置一致的字体锁定和编码风格，以便用于编辑所有这些语言。
</p>

<p>
请注意，此软件包的名称是 “cc mode”，但没有顶级 cc mode 入口点。cc mode 中的所有变量，命令和函数都以 c-thing，c-mode，c <del><del>-mode，objc-mode，java-mode，idl-mode，pike-mode 和 awk-mode 入口点为前缀。 该软件包旨在替代 c-mode.el，c</del></del>-mode.el 和 awk-mode.el。
</p>
</div>
</div>

<div id="outline-container-org87ea9f6" class="outline-2">
<h2 id="org87ea9f6"><span class="section-number-2">2</span> 基本使用</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org271fa92" class="outline-3">
<h3 id="org271fa92"><span class="section-number-3">2.1</span> 缩进量</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> c-basic-offset 6)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc19f739" class="outline-3">
<h3 id="orgc19f739"><span class="section-number-3">2.2</span> 缩进样式</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq</span> c-default-style '((java-mode . <span style="color: #ff4ea3;">"java"</span>)
                        (awk-mode . <span style="color: #ff4ea3;">"awk"</span>)
                        (other . <span style="color: #ff4ea3;">"linux"</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf02cca0" class="outline-3">
<h3 id="orgf02cca0"><span class="section-number-3">2.3</span> 自动缩进</h3>
<div class="outline-text-3" id="text-2-3">
<p>
当输入标点符号（';'或'{'）是，自动缩进的当前行。
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">setq-default</span> c-electric-flag t)
</pre>
</div>
<p>
回车键自动缩进新行。
</p>
</div>
</div>

<div id="outline-container-orgcf66771" class="outline-3">
<h3 id="orgcf66771"><span class="section-number-3">2.4</span> 快捷键</h3>
<div class="outline-text-3" id="text-2-4">
<p>
挑选几个没有注意到的
</p>
</div>

<div id="outline-container-org5edd8a6" class="outline-4">
<h4 id="org5edd8a6"><span class="section-number-4">2.4.1</span> C-c C-q (c-indent-defun)</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
缩进 point 所在的整个顶级函数、类或宏定义的范围。 此函数不能用于重新嵌套括号结构，例如嵌套类或函数或 Java 方法。 被重新缩进的顶级构造必须是完整的，即它必须同时具有开始大括号和结束大括号。
</p>
</div>
</div>

<div id="outline-container-org68261ba" class="outline-4">
<h4 id="org68261ba"><span class="section-number-4">2.4.2</span> C-M-h (c-mark-function)</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
虽然不是严格意义的缩进命令，但对于将当前顶级函数或类定义标记为当前区域很有用。 和 c-indent-defun 一样，这个命令在顶层构造上运行，并且不能用来标记一个 Java 方法。
</p>
</div>
</div>

<div id="outline-container-orgd60f27a" class="outline-4">
<h4 id="orgd60f27a"><span class="section-number-4">2.4.3</span> C-M-a (c-beginning-of-defun)</h4>
</div>

<div id="outline-container-org8e4c9c2" class="outline-4">
<h4 id="org8e4c9c2"><span class="section-number-4">2.4.4</span> C-M-e (c-end-of-defun)</h4>
</div>

<div id="outline-container-orgd095624" class="outline-4">
<h4 id="orgd095624"><span class="section-number-4">2.4.5</span> M-a (c-beginning-of-statement)</h4>
</div>

<div id="outline-container-org622adef" class="outline-4">
<h4 id="org622adef"><span class="section-number-4">2.4.6</span> M-e (c-end-of-statement)</h4>
</div>

<div id="outline-container-org1428883" class="outline-4">
<h4 id="org1428883"><span class="section-number-4">2.4.7</span> C-c C-u (c-up-conditional)</h4>
</div>

<div id="outline-container-orgca690c9" class="outline-4">
<h4 id="orgca690c9"><span class="section-number-4">2.4.8</span> M-x c-up-conditional-with-else</h4>
</div>

<div id="outline-container-org9502edc" class="outline-4">
<h4 id="org9502edc"><span class="section-number-4">2.4.9</span> M-x c-down-conditional-with-else</h4>
</div>

<div id="outline-container-orge4498cd" class="outline-4">
<h4 id="orge4498cd"><span class="section-number-4">2.4.10</span> C-c C-p (c-backward-conditional)</h4>
</div>

<div id="outline-container-org3b08155" class="outline-4">
<h4 id="org3b08155"><span class="section-number-4">2.4.11</span> C-c C-n (c-forward-conditional)</h4>
</div>
</div>
</div>

<div id="outline-container-orge7c0022" class="outline-2">
<h2 id="orge7c0022"><span class="section-number-2">3</span> minor modes</h2>
<div class="outline-text-2" id="text-3">
<p>
cc-mode 包含几个类似 minor-mode 的特性，可能在编写新代码或编辑旧代码时发现有用：
</p>
</div>
<div id="outline-container-org5752fd8" class="outline-3">
<h3 id="org5752fd8"><span class="section-number-3">3.1</span> electric mode</h3>
<div class="outline-text-3" id="text-3-1">
<p>
启用此功能后，输入某些可见字符会时导致重新格式化。这通常很有帮助，但在编辑乱码格式的代码时可能会造成麻烦。
</p>

<p>
这个有用，可以开启。
</p>
</div>
</div>

<div id="outline-container-org2274ed9" class="outline-3">
<h3 id="org2274ed9"><span class="section-number-3">3.2</span> auto-newline mode</h3>
<div class="outline-text-3" id="text-3-2">
<p>
这会如期望的那样自动插入换行符，例如输入'} 之后。
</p>

<p>
auto-newline 仅在以下条件成立时触发：
</p>
<ul class="org-ul">
<li>auto-newline minor mode 启用，此时 modeline 上 mode 名称后的指示符显示'a'（例如'C/a'或'C/la'）。</li>
<li>字符在一行的末尾输入，或者仅在后面输入空格，并且可能用'\'转义新行。</li>
<li>字符已不在自己的行中。 （这仅适用于在字符前插入换行符。）</li>
<li>该字符不是在文字中键入的。</li>
<li>没提供给该命令的数字参数（即，它是正常输入的，没有 C-u 前缀）。</li>
</ul>
</div>
</div>

<div id="outline-container-org1cd6da7" class="outline-3">
<h3 id="org1cd6da7"><span class="section-number-3">3.3</span> hungry-delete mode</h3>
<div class="outline-text-3" id="text-3-3">
<p>
这使您可以使用单个键删除包含空白符的连续块：例如，auto-newline 产生的新行和自动缩进前写入注释时。
</p>
</div>
</div>

<div id="outline-container-org0087ae6" class="outline-3">
<h3 id="org0087ae6"><span class="section-number-3">3.4</span> subword mode</h3>
<div class="outline-text-3" id="text-3-4">
<p>
这种模式使得像 M-f（forward-word）和 M-b（backward-word）这样的基本字移动命令将傻傻的符号的部分视为不同的字。例如，'NSGraphicsContext'被视为三个单词‘NS’, ‘Graphics’, and ‘Context.
</p>
</div>
</div>

<div id="outline-container-org16a5a5b" class="outline-3">
<h3 id="org16a5a5b"><span class="section-number-3">3.5</span> syntactic-indentation mode</h3>
<div class="outline-text-3" id="text-3-5">
<p>
当它启用时（通常情况下），缩进命令（如 C-j）根据其语法结构缩进代码行。否则，一行简单地缩进到与前一行相同的级别，&lt;TAB&gt; 以 c-basic-offset 的步长调整缩进。
</p>
</div>
</div>
</div>

<div id="outline-container-org879ad8b" class="outline-2">
<h2 id="org879ad8b"><span class="section-number-2">4</span> hooks</h2>
<div class="outline-text-2" id="text-4">
<p>
cc-mode 提供了几个 hook，可以使用这些 hook 将 cc-mode 设定为指定的编码风格。 主要的 hook 是 c-mode-common-hook; 通常，会将大部分自定义设置放在此处。 另外，每种语言模式都有自己的 hook，允许针对不同的 cc-mode 语言单独调整设置，并且有一个程序包初始化 hook。 最后，还有 c-special-indent-hook，它可以解决异常缩进问题。
</p>

<p>
打开 buffer 时，cc-mode 首先使用当前活动的样式对其进行初始化。 然后它调用 c-mode-common-hook，最后它调用语言特定的 hook。 因此，在这些 hook 中完成的任何样式设置都将覆盖由 c-default-style 设置的样式。
</p>
</div>
</div>

<div id="outline-container-org1326c62" class="outline-2">
<h2 id="org1326c62"><span class="section-number-2">5</span> style</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org14b0b53" class="outline-3">
<h3 id="org14b0b53"><span class="section-number-3">5.1</span> build-in style</h3>
<div class="outline-text-3" id="text-5-1">
<p>
gnu k&amp;r bsd whitesmith stroustrup ellemtel linux python java awk user
</p>
</div>
</div>

<div id="outline-container-orgae7de97" class="outline-3">
<h3 id="orgae7de97"><span class="section-number-3">5.2</span> 选择 style</h3>
</div>

<div id="outline-container-org76dbda6" class="outline-3">
<h3 id="org76dbda6"><span class="section-number-3">5.3</span> 添加和修改 style</h3>
</div>

<div id="outline-container-orgb666a01" class="outline-3">
<h3 id="orgb666a01"><span class="section-number-3">5.4</span> 猜测 style</h3>
<div class="outline-text-3" id="text-5-4">
<p>
除了指定 style，还可以通过让 cc-mode 检查已经格式化的代码缓冲区来猜测样式。
</p>

<p>
为此，请在样本缓冲区中调用 c-guess（或其他 5 个猜测命令之一）。
</p>

<p>
然后，可以使用 c-guess-install 在任何 cc-mode 缓冲区中设置猜测的样式。 可以使用 c-guess-view 显示样式，并将其复制到 <code>.emacs</code> 中以备将来使用。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-04-26 日 10:53</p>
<p class="validation"></p>
</div>
</body>
</html>
